# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightTableIterator..::..Dispose Method
ExportLineweightTableIterator Class See Also
---
Releases all resources used by the ExportLineweightTableIterator
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# See Also
ExportLineweightTableIterator Class
Autodesk.Revit.DB Namespace